nxp-appcodehub/dm-p3h2x4x-i3c-hub-demo-application/p3h2x4x_demo_app/frdmmcxa153_p3h2x4x_demoapp/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : LPI3C_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void LPI3C_InitPins(void)
{
	  CLOCK_EnableClock(kCLOCK_GateGPIO0);
    /* Write to PORT1: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT0);
    /* PORT1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT0_RST_SHIFT_RSTn);

    RESET_ReleasePeripheralReset(kGPIO0_RST_SHIFT_RSTn);

    const port_pin_config_t port0_16_config = {/* Internal pull-up/down resistor is disabled */
                                                       kPORT_PullDisable,
                                                       /* Low internal pull resistor value is selected. */
                                                       kPORT_LowPullResistor,
                                                       /* Fast slew rate is configured */
                                                       kPORT_FastSlewRate,
                                                       /* Passive input filter is disabled */
                                                       kPORT_PassiveFilterDisable,
                                                       /* Open drain output is disabled */
                                                       kPORT_OpenDrainDisable,
                                                       /* Low drive strength is configured */
                                                       kPORT_LowDriveStrength,
                                                       /* Normal drive strength is configured */
                                                       kPORT_NormalDriveStrength,
                                                       /* Pin is configured as I3C0_SDA */
                                                       kPORT_MuxAlt10,
                                                       /* Digital input enabled */
                                                       kPORT_InputBufferEnable,
                                                       /* Digital input is not inverted */
                                                       kPORT_InputNormal,
                                                       /* Pin Control Register fields [15:0] are not locked */
                                                       kPORT_UnlockRegister};
      /* PORT0_16 (pin 54) is configured as I3C0_SDA */
      PORT_SetPinConfig(PORT0, 16U, &port0_16_config);

      const port_pin_config_t port0_17_config = {/* Internal pull-up/down resistor is disabled */
                                                       kPORT_PullDisable,
                                                       /* Low internal pull resistor value is selected. */
                                                       kPORT_LowPullResistor,
                                                       /* Fast slew rate is configured */
                                                       kPORT_FastSlewRate,
                                                       /* Passive input filter is disabled */
                                                       kPORT_PassiveFilterDisable,
                                                       /* Open drain output is disabled */
                                                       kPORT_OpenDrainDisable,
                                                       /* Low drive strength is configured */
                                                       kPORT_LowDriveStrength,
                                                       /* Normal drive strength is configured */
                                                       kPORT_NormalDriveStrength,
                                                       /* Pin is configured as I3C0_SCL */
                                                       kPORT_MuxAlt10,
                                                       /* Digital input enabled */
                                                       kPORT_InputBufferEnable,
                                                       /* Digital input is not inverted */
                                                       kPORT_InputNormal,
                                                       /* Pin Control Register fields [15:0] are not locked */
                                                       kPORT_UnlockRegister};
      /* PORT0_17 (pin 55) is configured as I3C0_SCL */
      PORT_SetPinConfig(PORT0, 17U, &port0_17_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
LPI3C_DeinitPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '34', peripheral: GPIO3, signal: 'GPIO, 27', pin_signal: P3_27/TRIG_OUT7/LPI2C0_SCL/CT_INP13, slew_rate: fast, open_drain: disable, drive_strength: low,
    drive_strength1: normal, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: '33', peripheral: GPIO3, signal: 'GPIO, 28', pin_signal: P3_28/WUU0_IN26/TRIG_IN11/LPI2C0_SDA/CT_INP12, slew_rate: fast, open_drain: disable, drive_strength: low,
    drive_strength1: normal, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : LPI3C_DeinitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void LPI3C_DeinitPins(void)
{
	CLOCK_EnableClock(kCLOCK_GateGPIO0);
	    /* Write to PORT1: Peripheral clock is enabled */
	    CLOCK_EnableClock(kCLOCK_GatePORT0);
	    /* PORT1 peripheral is released from reset */
	    RESET_ReleasePeripheralReset(kPORT0_RST_SHIFT_RSTn);

	    RESET_ReleasePeripheralReset(kGPIO0_RST_SHIFT_RSTn);


    const port_pin_config_t port0_16_config = {/* Internal pull-up/down resistor is disabled */
                                                       kPORT_PullDisable,
                                                       /* Low internal pull resistor value is selected. */
                                                       kPORT_LowPullResistor,
                                                       /* Fast slew rate is configured */
                                                       kPORT_FastSlewRate,
                                                       /* Passive input filter is disabled */
                                                       kPORT_PassiveFilterDisable,
                                                       /* Open drain output is disabled */
                                                       kPORT_OpenDrainDisable,
                                                       /* Low drive strength is configured */
                                                       kPORT_LowDriveStrength,
                                                       /* Normal drive strength is configured */
                                                       kPORT_NormalDriveStrength,
                                                       /* Pin is configured as I3C0_SDA */
                                                       kPORT_MuxAlt0,
                                                       /* Digital input enabled */
                                                       kPORT_InputBufferEnable,
                                                       /* Digital input is not inverted */
                                                       kPORT_InputNormal,
                                                       /* Pin Control Register fields [15:0] are not locked */
                                                       kPORT_UnlockRegister};
      /* PORT0_16 (pin 54) is configured as I3C0_SDA */
      PORT_SetPinConfig(PORT0, 16U, &port0_16_config);

      const port_pin_config_t port0_17_config = {/* Internal pull-up/down resistor is disabled */
                                                       kPORT_PullDisable,
                                                       /* Low internal pull resistor value is selected. */
                                                       kPORT_LowPullResistor,
                                                       /* Fast slew rate is configured */
                                                       kPORT_FastSlewRate,
                                                       /* Passive input filter is disabled */
                                                       kPORT_PassiveFilterDisable,
                                                       /* Open drain output is disabled */
                                                       kPORT_OpenDrainDisable,
                                                       /* Low drive strength is configured */
                                                       kPORT_LowDriveStrength,
                                                       /* Normal drive strength is configured */
                                                       kPORT_NormalDriveStrength,
                                                       /* Pin is configured as I3C0_SCL */
                                                       kPORT_MuxAlt0,
                                                       /* Digital input enabled */
                                                       kPORT_InputBufferEnable,
                                                       /* Digital input is not inverted */
                                                       kPORT_InputNormal,
                                                       /* Pin Control Register fields [15:0] are not locked */
                                                       kPORT_UnlockRegister};
      /* PORT0_17 (pin 55) is configured as I3C0_SCL */
      PORT_SetPinConfig(PORT0, 17U, &port0_17_config);
}

